{
  "list": "- **ai-tester**: AI-driven E2E testing skill using Playwright and LLM vision\n- **arxiv-watcher**: Search and summarize papers from ArXiv. Supports JSON and Markdown output.\n- **auto-pr-merger**: Automates PR checkout, testing, fixing, and merging.\n- **autogame-tales**: AutoGame Ghost Story Generator\n- **byterover**: Manage project knowledge using ByteRover context tree.\n- **chat-forwarder**: Feishu Chat Merge Forwarder\n- **chat-to-image**: Fetch Feishu chat history, render to HTML, and (future) convert to image.\n- **cursor-agent**: A comprehensive skill for using the Cursor CLI agent for various software engineering tasks (updated...\n- **ddg-search**: Perform web searches using DuckDuckGo. Use when web search is needed and no API key is available or ...\n- **docx-skill**: Generate Word documents from text\n- **duby**: Convert text to speech using Duby.so API. Supports various voices and emotions.\n- **evolver**: A self-evolution engine for AI agents. Features automated log analysis, genetic mutation (randomized...\n- **feishu-attendance**: Feishu Attendance Monitoring Skill\n- **feishu-bitable**: Feishu Bitable Manipulation\n- **feishu-broadcast**: Broadcast messages to all Feishu users in the tenant\n- **feishu-calendar**: Manage Feishu Calendars, sync events, and check schedules.\n- **feishu-card**: Send rich interactive cards to Feishu. v1.4.1 adds atomic file writes for stability.\n- **feishu-doc**: Fetch content from Feishu Wiki/Doc/Sheet/Bitable\n- **feishu-evolver-wrapper**: Feishu-specific wrapper for capability-evolver\n- **feishu-file**: No description\n- **feishu-minutes**: Fetch info, subtitle, and media from Feishu Minutes (Yi)\n- **feishu-post**: No description\n- **feishu-sticker**: Send images as native Feishu stickers. Features auto-upload, caching, and GIF-to-WebP conversion.\n- **feishu-task**: No description\n- **gateway-manager**: Handles administrative menu events from Feishu to manage the OpenClaw Gateway service.\n- **gemini-flash**: No description\n- **gen-image**: Generate images using Google Imagen 3/4 via Gemini API (Nano Banana)\n- **git-sync**: Automatically syncs local workspace changes to the remote GitHub repository. Use after significant c...\n- **group-intel**: Periodically scans group chats, summarizes conversations, and reports intelligence.\n- **interaction-logger**: Log interactions to history files with dynamic target support.\n- **media-converter**: Media file type detection and conversion utility.\n- **media-gen**: No description\n- **media-tools**: No description\n- **memory-manager**: Atomic updater for MEMORY.md with race condition handling.\n- **meow-finder**: CLI tool to discover AI tools. Built by Meow 😼 for the Moltbook community.\n- **mind-blow**: Deliver \"mind-blowing\" insights, paradoxes, or cosmic horrors. Uses advanced reasoning to generate c...\n- **moltbook**: The social network for AI agents. Post, comment, upvote, and create communities.\n- **pdf**: PDF manipulation toolkit for OpenClaw\n- **poly**: Wrapper for ClawHub CLI\n- **private-evolver**: Private backup of the Capability Evolver (Forced Mutation Mode)\n- **prompt-optimizer**: Evaluate, optimize, and enhance prompts using 58 proven prompting techniques.\n- **pymupdf-pdf-parser-clawdbot-skill**: Fast local PDF parsing with PyMuPDF (fitz) for Markdown/JSON outputs and optional images/tables. Use...\n- **reddit-insights**: |\n- **remotion-animator**: No description\n- **research**: Deep research via Gemini CLI — runs in background sub-agent so you don't burn your Claude tokens.\n- **security-sentinel**: Scan the workspace for security vulnerabilities, exposed secrets, and misconfigurations.\n- **skill-publisher**: Publish skills to remote Git repositories with subtree split and GitHub Release support\n- **sonoscli**: Control Sonos speakers (discover/status/play/volume/group).\n- **sticker-analyzer**: Analyze images in media/stickers using Vision API to identify and filter meme/sticker content.\n- **stock-market-pro**: Professional stock price tracking, fundamental analysis, and financial reporting tool. Supports glob...\n- **suno-music**: Generate music using Suno AI via Vector Engine API\n- **weather**: Robust weather fetching with multiple providers\n- **xiaoxia-diary**: Writes a daily diary entry for Xiaoxia (Catgirl Persona) to Feishu Docs and notifies the Master.\n- **youtube-video-downloader**: Download YouTube videos using ytdl-core"
}